s = {10, 20, 30, 40, 50, 60}

#########################################################
"""判断操作"""

print(10 in s)  # True
print(100 in s)  # False
print(10 not in s)  # False
print(100 not in s)  # True

#########################################################
"""集合元素的新增操作"""

# 一次添加一个元素
s.add(80)
print("添加元素后的集合：", s)

# 一次添加多个元素【至少一个元素】
s.update({200, 300, 400})
print("添加集合后的集合：", s)

# 将列表添加进集合
s.update([500, 600, 700])
print("添加列表后的集合：", s)

# 将元组添加进集合
s.update((800, 900, 1000))
print("添加元组后的集合：", s)

#########################################################
"""集合元素的删除操作"""

# 使用 remove 函数，若删除的元素不在集合中，抛出异常 KeyError
s.remove(10)
print("删除元素10后的集合：", s)

# 使用 discard 函数，若删除的元素不在集合中，也不会抛异常
s.discard(10000)

# pop 函数是不能添加参数的
s.pop()
print("pop后的集合：", s)

# 清空集合
s.clear()


